INSERT INTO course_registration_request_status(status)
VALUES ('PROCESSING'),
       ('APPROVED'), -- одобрена (ещё не обучается)
       ('ACCEPTED'); -- принята (допущен до обучения)
INSERT INTO course_registration_request_keeper_status(status)
VALUES ('PROCESSING'),
       ('APPROVED'), -- одобрена конкретным хранителем (статус запроса тоже меняется на APPROVED)
       ('REJECTED'); -- заявка отклонена конкретным хранителем
INSERT INTO course_registration_request(course_id, person_id, request_date, status_id)
VALUES (1, 1, '2023-07-20', 3),
       (1, 2, '2023-07-20', 3),
       (1, 3, '2023-07-20', 3),
       (1, 4, '2023-07-20', 3),
       (1, 5, '2023-07-20', 3),
       (1, 6, '2023-07-20', 3),
       (1, 7, '2023-07-20', 3),
       (1, 8, '2023-07-20', 3),
       (1, 9, '2023-07-20', 3),
       (1, 10, '2023-07-20', 3),
       (1, 12, '2023-07-06', 1),
       (7, 12, '2023-07-06', 3),
       (10, 11, '2023-07-06', 3),
       (8, 13, '2023-07-06', 1),
       (9, 12, '2023-07-06', 3),
       (2, 11, '2023-07-06', 3),
       (3, 11, '2023-07-06', 3),
       (4, 11, '2023-07-06', 3),
       (5, 11, '2023-07-06', 3),
       (2, 25, '2023-07-06', 3),
       (3, 24, '2023-07-06', 2),
       (5, 23, '2023-07-06', 1);
INSERT INTO course_registration_request_keeper(request_id, keeper_id, response_date, status_id)
VALUES (1, 11, '2023-08-23', 2),
       (2, 11, '2023-08-23', 2),
       (3, 11, '2023-08-23', 2),
       (4, 11, '2023-08-23', 2),
       (5, 11, '2023-08-23', 2),
       (6, 11, '2023-08-23', 2),
       (7, 11, '2023-08-23', 2),
       (8, 11, '2023-08-23', 2),
       (9, 11, '2023-08-23', 2),
       (10, 11, '2023-08-23', 2),
       (11, 11, '2023-08-23', 3),
       (12, 13, '2023-08-23', 2),
       (13, 14, '2023-08-23', 2),
       (14, 15, '2023-08-23', 1),
       (15, 16, '2023-08-23', 2),
       (16, 2, '2023-08-23', 2),
       (17, 3, '2023-08-23', 2),
       (18, 4, '2023-08-23', 2),
       (19, 5, '2023-08-23', 2),
       (20, 43, '2023-08-23', 2),
       (20, 2, '2023-08-23', 3),
       (20, 17, '2023-08-23', 3),
       (21, 44, '2023-08-23', 2),
       (21, 3, '2023-08-23', 3),
       (22, 45, '2023-08-23', 1),
       (22, 4, '2023-08-23', 1);
INSERT INTO rejection_reason(name)
VALUES ('Нет времени'),
       ('Плохая мотивация'),
       ('Недостаточный уровень подготовки'),
       ('Истек срок подачи заявки'),
       ('Проблемы с оплатой'),
       ('Технические проблемы'),
       ('Недостаточное количество мест'),
       ('Отсутствие необходимых ресурсов'),
       ('Несовместимое расписание'),
       ('Проблемы с подтверждением личности'),
       ('Ограничения по возрасту'),
       ('Другое');
INSERT INTO keeper_rejection(response_id, reason_id)
VALUES (11, 1);